Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: First, prepare `application.properties`. You can start with a completely empty `application.properties` as `Dev Services for Keycloak` will register `quarkus.oidc.auth-server-url` pointing to the running test container as well as `quarkus.oidc.client-id=quarkus-app` and `quarkus.oidc.credentials.secret=secret`.
ja_jp: まず、 `application.properties` を準備します。 `Dev Services for Keycloak` が実行中のテストコンテナを指す `quarkus.oidc.auth-server-url` を登録し、 `quarkus.oidc.client-id=quarkus-app` と `quarkus.oidc.credentials.secret=secret` も登録するので、完全に空の `application.properties` で始めることができます。

source: First, prepare the `application.properties` file.
ja_jp: まず、 `application.properties` ファイルを準備します。

source: First, replace the `@Authenticated` annotation with `@PermissionsAllowed("user:email")`, with the latter implying the former and requiring a user authentication too:
ja_jp: まず、 `@Authenticated` アノテーションを `@PermissionsAllowed("user:email")` に置き換えます。後者は前者を含んでおり、同様にユーザー認証を必要とします。

source: First, run the application using dev mode from the project directory:
ja_jp: まず、プロジェクトディレクトリからDevモードでアプリケーションを実行します。

source: First, run the application using:
ja_jp: まず、アプリケーションを実行します。

source: First, start Consul:
ja_jp: まず、Consulを起動します:

source: First, start a Neo4j instance:
ja_jp: まず、Neo4jのインスタンスを起動します。

source: First, the Mongo client is injected. Note that it uses the reactive variant (`io.quarkus.mongodb.reactive.ReactiveMongoClient`). In the initialize method, we retrieve and store the collection in which elements will be inserted.
ja_jp: まず、Mongo のクライアントをインジェクションします。リアクティブ版 ( `io.quarkus.mongodb.reactive.ReactiveMongoClient`) を使っていることに注意しましょう。initialize メソッドでは、要素を挿入するためのコレクションを取得して保存します。

source: First, the `specversion` indicates which version of Cloud Event it is using (1.0). The `id` field provides an id for that specific event. The `source` attribute is a URI identifying the event source, i.e., the context in which an event happened or the application that emitted that specific event. Combining the `id` and the `source` provides a unique identifier. Such uniqueness is essential to implement idempotence and handle potential duplicates. The `type` is the last mandatory attribute. It indicates the _type_ of the event. Here, I use the fully qualified class name, but you can imagine anything. It should refer to the kind of event you have defined in your system.
ja_jp: まず、 `specversion` は、使用しているクラウドイベントのバージョン(1.0)を示しています。 `id` フィールドは、その特定のイベントの ID を提供します。 `source` 属性は、イベントソースを識別する URI であり、イベントが発生したコンテキストや、特定のイベントを発生させたアプリケーションを示します。 `id` と `source` を組み合わせることで、一意な識別子が得られます。このような一意性は、冪等性を実装し、潜在的な重複を処理するために不可欠です。 `type` は最後の必須属性です。これはイベントの _タイプ_ を示します。ここでは完全修飾クラス名を使用していますが、何を想像しても構いません。システムで定義されているイベントの種類を参照する必要があります。

source: First, the response time is smaller because it does not have to jump to another thread.
ja_jp: まず、別のスレッドにジャンプする必要がないので、レスポンス時間が短くなります。

source: First, the stack traces that contain method calls to `com.oracle.svm.core.genscavenge.ThreadLocalAllocation` are related to aligned or unaligned heap chunk allocations explained above. As noted earlier, for the majority of allocations these chunks will be 1MB by default, so they're interesting because each allocated chunk has a considerable effect on the RSS consumption.
ja_jp: まず、 `com.oracle.svm.core.genscavenge.ThreadLocalAllocation` のメソッドコールを含むスタックトレースは、上で説明した整列または非整列ヒープチャンク割り当てに関連しています。前述のように、大半の割り当てでは、これらのチャンクはデフォルトで1MBになるので、割り当てられた各チャンクがRSS消費量にかなりの影響を与えるため、興味深いものです。

source: First, we can list the available threads with:
ja_jp: まず、利用可能なスレッドを以下のように一覧表示できます。

source: First, we need a Java file. JBang lets you create an initial version using:
ja_jp: 最初に、Java ファイルが必要です。JBang を使うと、次のように初期バージョンの Java ファイルを作成することができます。

source: First, we need a new Kotlin project. This can be done using the following command:
ja_jp: まず、新しいKotlinプロジェクトが必要です。これは以下のコマンドで行うことができます。

source: First, we need a new Quarkus project. To create a new Quarkus project, you can reference the link:{https://quarkus.io/guides/maven-tooling}[Quarkus and Maven Guide]
ja_jp: まず、新しい Quarkus プロジェクトが必要です。 新しい Quarkus プロジェクトを作成するには、{https://quarkus.io/guides/maven-tooling} [Quarkus と Maven ガイド] を参照してください。

source: First, we need a new project that contains the OpenShift extension. This can be done using the following command:
ja_jp: まず、OpenShift エクステンションを含む新しいプロジェクトが必要です。これは以下のコマンドを使用して行うことができます。

source: First, we need a new project with the temperature value producer. Create a new project with the following command:
ja_jp: まず、温度値プロデューサを持つ新しいプロジェクトが必要です。以下のコマンドで新規プロジェクトを作成します。

source: First, we need a new project. Create a new project by running the following command:
ja_jp: まず、新しいプロジェクトが必要です。以下のコマンドを実行して新しいプロジェクトを作成します：

source: First, we need a new project. Create a new project with the following command:
ja_jp: まず、新しいプロジェクトが必要です。以下のコマンドで新規プロジェクトを作成します。

source: First, we need a project that defines a CLI application. We recommend using the xref:picocli.adoc[PicoCLI] extension. This can be done using the following command:
ja_jp: まず，CLIアプリケーションを定義したプロジェクトが必要です。 link:picocli.html[PicoCLI]エクステンションの使用をお勧めします。これは以下のコマンドで行うことができます。

source: First, we need a project. Open your browser to https://code.quarkus.io and select the following extensions:
ja_jp: まず、プロジェクトを用意します。ブラウザで https://code.quarkus.io を開き、以下のエクステンションを選択します。

source: First, we need an application. To keep things simple, let's create a new application from https://code.quarkus.io/?a=upx-compression-demo&e=resteasy-reactive-jacksoncode.quarkus.io. This application uses RESTEasy Reactive and its Jackson support, but the compression works with any project, and we won't even look at the code.
ja_jp: まず、アプリケーションが必要です。簡単にするために、 https://code.quarkus.io/?a=upx-compression-demo&amp;e=resteasy-reactive-jacksoncode.quarkus.io から新しいアプリケーションを作ってみましょう。このアプリケーションはRESTEasy ReactiveとそのJacksonサポートを使用していますが、圧縮はどのようなプロジェクトでも機能するので、コードを見ることもしません。

source: First, we need to call our greetings service: `http://quarkus-micrometer-my-project.ocp.host/hello/quarkus`. This will increment the `greeting_counter_total` counter. But where can we see the metrics? Let's browse to OpenShift Console in the `Developer > Monitoring` view, select `Metrics`, then `Custom Query` and type `greeting_counter_total{name = "quarkus"}`, we should see now:
ja_jp: まず、グリーティングサービスを呼び出す必要があります: `http://quarkus-micrometer-my-project.ocp.host/hello/quarkus` 。これで `greeting_counter_total` カウンターが増加します。しかし、このメトリクスはどこで見ることができるでしょうか？OpenShift Console の `Developer > Monitoring` view, select `Metrics` を開き、 `Metrics` を選択し、次に `Custom Query` を選択し、 `greeting_counter_total{name = "quarkus"}` と入力してみましょう。これで次のように表示されます:

source: First, we need to create a new Quarkus project with the following command:
ja_jp: まず、以下のコマンドで新しいQuarkusプロジェクトを作成します。

source: First, we need to create an instance of `WebClient`. Extend the `VertxResource` class with the `client` field and the creation of the web client in the constructor:
ja_jp: まず、 `WebClient` のインスタンスを作成する必要があります。 `client` フィールドとウェブクライアントの作成をコンストラクタに追加して、 `VertxResource` クラスを拡張します：

source: First, we need to create two projects: the _producer_ and the _processor_.
ja_jp: まず、 _producer_ と _processor_ の2つのプロジェクトを作成する必要があります。

source: First, we will need to package it:
ja_jp: まず、パッケージ化します:

source: First, we would like to thank the OpenJDK team at IBM for their work on Project Leyden and for the many discussions we had with them, which were instrumental in helping us understand Leyden and determine how best to integrate it into Quarkus, namely (in alphabetical order), Maria Arias de Reyna Dominguez, Andrew Dinn, and Ashutosh Mehra.
ja_jp: まず、Project Leyden に関する取り組みと、Leyden を理解し、Quarkus に統合するための最善の方法を決定する上で非常に役立った多くの議論について、IBM の OpenJDK チームに感謝いたします。具体的には（アルファベット順で）、Maria Arias de Reyna Dominguez 氏、Andrew Dinn 氏、および Ashutosh Mehra 氏です。

source: First, you can consume messages from various brokers such as AMQP or Apache Kafka, and process these messages smoothly:
ja_jp: まず、AMQPやApache Kafkaなどの各種ブローカーからのメッセージを消費し、そのメッセージをスムーズに処理することができます。

source: First, you can create a BSON Codec which will be automatically registered by Quarkus and will be used instead of the `PojoCodecProvider`. See this part of the documentation: xref:mongodb.adoc#simplifying-mongodb-client-usage-using-bson-codec[Using BSON codec].
ja_jp: まず、BSON Codecを作成すると、Quarkusに自動的に登録され、 `PojoCodecProvider` の代わりに使用されます。ドキュメントのこの部分を参照してください。 link:mongodb.html#simplifying-mongodb-client-usage-using-bson-codec[BSONコーデックの使用]

source: First, you have to declare that your synthetic bean injects the `InterceptionProxy`:
ja_jp: まず、合成 Bean が `InterceptionProxy` を注入することを宣言する必要があります。

source: First, you instruct Quarkus to generate Knative resources:
ja_jp: まず、QuarkusにKnativeリソースの生成を指示します：

source: First, you must add the following dependency to the build file, in your xref:writing-extensions.adoc#project-setup[deployement] module :
ja_jp: まず、 xref:writing-extensions.adoc#project-setup[デプロイメント] モジュールの ビルド・ファイルに、以下の依存関係を追加してください：

source: First, you need a new project that contains the OpenShift extension. Then, before you build and deploy our application, you must log into an OpenShift cluster.
ja_jp: まず、OpenShift エクステンションを含む新しいプロジェクトが必要です。そして、アプリケーションをビルドしてデプロイする前に、OpenShift クラスタにログインする必要があります。

source: First, you need a new project that contains the OpenShift extension. Then, before you build and deploy your application, you must log into an OpenShift cluster.
ja_jp: まず、OpenShift エクステンションを含む新しいプロジェクトが必要です。次に、アプリケーションをビルドしてデプロイする前に、OpenShift クラスターにログインする必要があります。

source: First, you need a new project. Create a new project with the following command:
ja_jp: まず、新しいプロジェクトが必要です。 以下のコマンドで新規プロジェクトを作成します。

source: First, you need to add the `quarkus-redis-cache` extension to your project:
ja_jp: まず、 `quarkus-redis-cache` のエクステンションをプロジェクトに追加する必要があります:

source: First, you need to create a Fluentd image with the Elasticsearch plugin. You can use the following Dockerfile that should be created inside a `fluentd` directory.
ja_jp: まず、Elasticsearch プラグインで Fluentd イメージを作成する必要があります。 以下の Dockerfile を使用できます。このファイルは `fluentd` ディレクトリー内に作成する必要があります。

source: First, you need to create a Fluentd image with the elasticsearch plugin. You can use the following Dockerfile that should be created inside a `fluentd` directory.
ja_jp: まず、elasticsearchプラグインでFluentdイメージを作成する必要があります。 以下の Dockerfile を使用することができます。このファイルは `fluentd` ディレクトリー内に作成する必要があります。

source: First, you need to create a Fluentd image with the needed plugins: elasticsearch and input-gelf. You can use the following Dockerfile that should be created inside a `fluentd` directory.
ja_jp: まず、必要なプラグインである elasticsearch と input-elf を使って Fluentd イメージを作成します。 以下の Dockerfile を使用することができます。このファイルは `fluentd` ディレクトリー内に作成する必要があります。

source: First, you need to include the `quarkus-jsonb` extension.
ja_jp: まず、 `quarkus-jsonb` エクステンションをインクルードする必要があります。

source: First, you need to name it to avoid collisions in case multiple credentials providers are available in the project:
ja_jp: まず、プロジェクト内で複数のクレデンシャルプロバイダーが利用可能な場合の衝突を避けるために、名前を付ける必要があります。

source: First, you see an option to *Log into Single Page Application*. For example:
ja_jp: まず、*Log into Single Page Application* オプションが表示されます。 次に例を示します。

source: First, you will need to add the `quarkus-agroal` dependency to your project.
ja_jp: まず、 `quarkus-agroal` 依存関係をプロジェクトに追加する必要があります。

source: First-Class Support for GraalVM Native Images
ja_jp: GraalVM ネイティブイメージのファーストクラスのサポート

source: First: Locking using findById().
ja_jp: 1つ目: findById()を使ってロックする。

source: First: an example
ja_jp: 最初に:一例

source: Fix issues
ja_jp: 問題点の修正

source: Fix it by configuring Quarkus to request a standard OIDC `profile` scope during the authentication process which should result in the ID token including more information:
ja_jp: これを修正するには、認証プロセス中に標準の OIDC `profile` スコープを要求するように Quarkus を設定します。これにより、ID トークンにさらに多くの情報が含まれるようになります。

source: Fix it by telling Quarkus OIDC which claim must be checked to enforce RBAC:
ja_jp: RBAC を適用するためにどのクレームをチェックする必要があるかを Quarkus OIDC に指示して修正します。

source: Fixed port for a named datasource.
ja_jp: 指定されたデータソースの固定ポート。

source: Fixed port for the default datasource.
ja_jp: デフォルトデータソースの固定ポート。

source: Fixing the tests
ja_jp: テストの修正

source: Flash messages are handled by the `main` DEV template and will result in nice notifications for your users:
ja_jp: フラッシュメッセージは `main` DEV テンプレートで処理され、ユーザーへの素敵な通知になります。

source: Floods of notifications is a challenge we already have but with GitHub Discussions we have much better control than almost any other communication platform. To tweak those settings click the "Watch" button in the upper right corner on https://github.com/quarkusio/quarkus[quarkusio/quarkus] repository and turn on/off the areas as appropriate for you.
ja_jp: 通知の洪水は私たちがすでに抱えている課題ですが、GitHub Discussions を使えば、他のコミュニケーション・プラットフォームよりもはるかにうまくコントロールすることができます。これらの設定を微調整するには、 link:https://github.com/quarkusio/quarkus[quarkusio/quarkus]リポジトリの右上にある "Watch" ボタンをクリックして、自分に合った領域をオン/オフします。

source: Flyway and Hibernate ORM
ja_jp: FlywayとHibernate ORM

source: Flyway and Reactive datasources
ja_jp: Flyway とリアクティブ・データソース

source: Flyway can be configured for multiple datasources. The Flyway properties are prefixed exactly the same way as the named datasources, for example:
ja_jp: Flyway は、複数のデータソースに対して設定可能です。Flyway のプロパティーには、例えば、名前の付いたデータソースと全く同じように接頭辞が付けられます。

source: Flyway integration
ja_jp: Flyway 統合

source: Flyway internally relies on a JDBC datasource, whereas reactive use cases will rely on xref:reactive-sql-clients.adoc[reactive SQL clients], either directly or through xref:hibernate-reactive.adoc[Hibernate Reactive]. This is not a problem in Quarkus, because xref:datasource.adoc#jdbc-and-reactive-datasources-simultaneously[a single configured datasource can be made available both through reactive clients and JDBC].
ja_jp: Flywayは内部的にJDBCデータソースに依存していますが、 リアクティブな使用例では xref:reactive-sql-clients.adoc[リアクティブSQLクライアント] に依存しています。 Quarkusでは、 xref:datasource.adoc#jdbc-and-reactive-datasources-simultaneously[1つの設定済みデータソースをリアクティブクライアントとJDBCの両方で使用] できるため、これは問題ではありません。

source: Flyway on Kubernetes
ja_jp: KubernetesでFlyway

source: Flyway support relies on the Quarkus datasource config. It can be customized for the default datasource as well as for every <<multiple-datasources,named datasource>>. First, you need to add the datasource config to the `{config-file}` file in order to allow Flyway to manage the schema. Also, you can customize the Flyway behaviour by using the following properties:
ja_jp: Flyway のサポートは、Quarkus のデータソース設定に依存しています。この設定は、デフォルトのデータソースだけでなく、 すべての link:#multiple-datasources[名前の付いたデータソース] に対してカスタマイズすることができます。まず、Flyway によるスキーマ管理を可能にするために、データソース設定を `{config-file}` ファイルに追加する必要があります。また、以下のプロパティーを使用して、Flyway の動作をカスタマイズすることができます。

source: Flyway support relies on the Quarkus datasource config. It can be customized for the default datasource as well as for every xref:multiple-datasources[named datasource]. First, you need to add the datasource config to the `{config-file}` file in order to allow Flyway to manage the schema. Also, you can customize the Flyway behaviour by using the following properties:
ja_jp: Flywayのサポートは、Quarkusのデータソース設定に依存しています。この設定は、デフォルトのデータソースだけでなく、 xref:multiple-datasources[名前付データソース] に対してもカスタマイズすることが可能です。まず、Flywayがスキーマを管理できるようにするために、 `{config-file}` ファイルにデータソースconfigを追加する必要があります。また、以下のプロパティを使用することで、Flywayの動作をカスタマイズすることができます:

source: Flyway was updated to 8.0.
ja_jp: Flywayを8.0にアップデートしました。

source: Follow OIDC provider redirects
ja_jp: OIDC プロバイダーのリダイレクトへの追従

source: Follow Quarkus on Twitter
ja_jp: Twitter で Quarkus をフォロー

source: Follow Us
ja_jp: フォローする

source: Follow the instruction to verify the sender domain using DKIM
ja_jp: 指示に従って、DKIMを使用して送信ドメインを確認します

source: Follow the instructions at link:https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services documentation] to enable authorization policies in the `quarkus` realm.
ja_jp: `quarkus` レルムで認可ポリシーを有効にするには、link:https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services ドキュメント] の指示に従ってください。

source: Follow the instructions in the next sections and create the application step by step. Alternatively, you can go right to the completed example.
ja_jp: 次のセクションの指示に従って、ステップバイステップでアプリケーションを作成してください。あるいは、完成した例にすぐに進むこともできます。

source: Follow the instructions in the next sections and create the application step by step. You can also go straight to the completed example.
ja_jp: 次のセクションの指示に従って、アプリケーションを段階的に作成します。 完成した例に直接進むこともできます。

source: Follow the link and you'll be able log in to your provider, get the tokens and test the application. The experience will be the same as described in the <<keycloak-authorization-code-grant,Authorization Code Grant for Keycloak>> section, where `Dev Services for Keycloak` container has been started, especially if you work with Keycloak (please also pay attention to a `redirect_uri` note in that section).
ja_jp: リンクをたどると、プロバイダーにログインしてトークンを取得し、アプリケーションをテストできます。特に Keycloakを使用している場合、これは `Dev Services for Keycloak` コンテナーを起動した <<keycloak-authorization-code-grant,Authorization Code Grant for Keycloak>> セクション (同セクションの `redirect_uri` に関する注意書きも確認してください) で説明したとおりです。

source: Follow the link to log in to your provider, get the tokens, and test the application. The experience is the same as described in the <<keycloak-authorization-code-grant,Authorization code grant for Keycloak>> section, where the Dev Services for Keycloak container has been started, especially if you work with Keycloak.
ja_jp: リンクをたどってプロバイダーにログインし、トークンを取得して、アプリケーションをテストします。 特に Keycloakを使用している場合、これは `Dev Services for Keycloak` コンテナーを起動した <<keycloak-authorization-code-grant,Authorization code grant for Keycloak>> セクションの説明のとおりです。

source: Follow the link, and you will be able to log in to your provider, get the tokens and test the application. The experience will be the same as described in the <<keycloak-authorization-code-grant,Authorization Code Grant for Keycloak>> section, where `Dev Services for Keycloak` container has been started, especially if you work with Keycloak.
ja_jp: リンクをたどると、プロバイダーにログインしてトークンを取得し、アプリケーションをテストできます。特に Keycloakを使用している場合、これは `Dev Services for Keycloak` コンテナーを起動した <<keycloak-authorization-code-grant,Keycloakに対する認可コードグラント>> セクションで説明したとおりです。

source: Follow the link, and you will be able to log in to your provider, get the tokens and test the application. The experience will be the same as described in the xref:keycloak-authorization-code-grant[Authorization Code Grant for Keycloak] section, where `Dev Services for Keycloak` container has been started, especially if you work with Keycloak.
ja_jp: リンクをたどると、プロバイダにログインしてトークンを取得し、アプリケーションをテストできるようになります。特にKeycloakと連携している場合は、 `Dev Services for Keycloak` コンテナが開始された xref:keycloak-authorization-code-grant[Keycloakの認可コードグラント] のセクションで説明したような体験ができるはずです。

source: Follow the same approach if the endpoint must access other Google services.
ja_jp: エンドポイントが他のGoogleサービスにアクセスする必要がある場合も、同じ方法でアクセスする。

source: Follow the steps below to have your Quarkus application prepared and automatically updated with new and renewed Let's Encrypt certificates.
ja_jp: 以下のステップに従って、Quarkus アプリケーションを準備し、新しい Let's Encrypt 証明書と更新された Let's Encrypt 証明書で自動的に更新します。

source: Follow the steps below to prepare your Quarkus application and automatically update it with new and renewed Let's Encrypt certificates.
ja_jp: 以下のステップに従って Quarkus アプリケーションを準備し、新しい Let's Encrypt 証明書および更新された Let's Encrypt 証明書で自動的に更新されるようにします。

source: Follow the xref:amazon-lambda-http.adoc[Amazon Lambda Http Guide]. It walks through using a variety of HTTP frameworks on Amazon Lambda, including Funqy.
ja_jp: link:amazon-lambda-http.html[Amazon Lambda Http Guide] に従います。Funqyをはじめとする様々なHTTPフレームワークをAmazon Lambdaで使用する方法を説明しています。

source: Follow the xref:aws-lambda-http.adoc[AWS Lambda Http Guide]. It walks through using a variety of HTTP frameworks on AWS Lambda, including Funqy.
ja_jp: xref:aws-lambda-http.adoc[AWS Lambda Http Guide] に従ってください。Funqyを含むAWS Lambda上の様々なHTTPフレームワークの使い方を解説しています。

source: Follow the xref:azure-functions-http.adoc[Azure Functions HTTP Guide]. It walks through using a variety of HTTP frameworks on Azure Functions. Including Funqy.
ja_jp: xref:azure-functions-http.adoc[Azure Functions HTTP Guide] に従ってください。このガイドでは、Azure FunctionsでさまざまなHTTPフレームワークを使用する方法を説明しています。Funqyも含まれています。

source: Follow the xref:gcp-functions-http.adoc[Google Cloud Functions Http Guide]. It walks through using a variety of HTTP frameworks on Google Cloud Functions, including Funqy.
ja_jp: link:gcp-functions-http.html[Google Cloud Functions Http Guide] に従ってください。このガイドでは、FunqyをはじめとするさまざまなHTTPフレームワークをGoogle Cloud Functionsで使用する方法を説明しています。

source: Follow the xref:hibernate-orm.adoc#setting-up-and-configuring-hibernate-orm[Hibernate set-up guide for all configuration].
ja_jp: すべての設定は、xref:hibernate-orm.adoc#setting-up-and-configuring-hibernate-orm[Hibernateセットアップガイド]を確認してください。

source: Follow-ups
ja_jp: その後の展開

source: Following application properties are automatically set:
ja_jp: 以下のアプリケーションプロパティーが自動的に設定されます:

source: Following are examples of the Flyway SQL files to be created in the configured folder `src/main/resources/database`.
ja_jp: 以下は、設定されたフォルダー `src/main/resources/database` に作成する Flyway SQL ファイルの例です。

source: Following are the list of configuration attributes for the Pulsar connector channels, consumers, producers and clients. See the <<pulsar-client-configuration>> for more information on how the Pulsar clients are configured.
ja_jp: 以下は、Pulsar コネクターのチャネル、コンシューマー、プロデューサー、およびクライアントの設定属性のリストです。 Pulsar クライアントの設定方法の詳細は、<<pulsar-client-configuration>> を参照してください。

source: Following is an example from the Agroal extension that provides a `DataSourceHealthCheck` to validate the readiness of a datasource.
ja_jp: 以下は、データソースの readiness を検証するための `DataSourceHealthCheck` を提供する Agroal エクステンションの例です。

source: Following is the configuration reference for the underlying `PulsarClient`. These options can be configured using the channel attribute:
ja_jp: 以下は、基盤となる `PulsarClient` の設定リファレンスです。 これらのオプションは、チャネル属性を使用して設定できます。

source: Following parameter keys:
ja_jp: 以下のパラメーターキー:

source: Following the execution of `./mvnw package -Dquarkus.container-image.build=true` you will notice amongst the other files that are created, two files named `openshift.json` and `openshift.yml` in the `target/kubernetes/` directory.
ja_jp: `./mvnw package -Dquarkus.container-image.build=true` の実行後に、作成された他のファイルの中に `openshift.json` と `openshift.yml` という名前の 2 つのファイルが `target/kubernetes/` ディレクトリーにあることに気づくでしょう。

source: Following the execution of `./mvnw package` you will notice amongst the other files that are created, two files named `knative.json` and `knative.yml` in the `target/kubernetes/` directory.
ja_jp: `./mvnw package` の実行後、作成された他のファイルの中に `knative.json` と `knative.yml` という名前のファイルが `target/kubernetes/` ディレクトリーにあることに気づくでしょう。

source: Following the feedback from users, let’s imagine you want to use Hibernate _classic_ with RESTEasy _reactive_:
ja_jp: ユーザーからのフィードバックを受けて、RESTEasy _reactive_ でHibernate _classic_ を使用する場合を考えてみましょう。

source: Following the https://infinispan.org/get-started/[Get Started Tutorial] (5 minutes).
ja_jp: link:https://infinispan.org/get-started/[入門チュートリアル] に沿う（5分）。

source: Following the previous example, let's now customize the `com.fasterxml.jackson.databind.ObjectReader` to read JSON requests with unquoted field names:
ja_jp: 前の例に従って、フィールド名が引用符で囲まれていない JSON リクエストを読み取るように `com.fasterxml.jackson.databind.ObjectReader` をカスタマイズしてみましょう。

source: Following the reactive nature of Vert.x, the API contains mostly asynchronous methods. These methods are following a syntax convention:
ja_jp: Vert.x のリアクティブな性質にしたがって、API のほとんどを非同期メソッドが占めています。これらのメソッドは構文規則に従っています:
